Revit 2027 API
ElementLogicalFilter.GetFilters Method
 Returns an array of copies of the filters that are logically combined by this ElementLogicalFilter.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public IList<ElementFilter> GetFilters()
Public Function GetFilters As IList(Of ElementFilter)
public:
IList<ElementFilter^>^ GetFilters()
member GetFilters : unit -> IList<ElementFilter>
Return Value
IList<ElementFilter>
 Copies of the filters that are logically combined by this ElementLogicalFilter.
See Also
Reference
ElementLogicalFilter Class
Autodesk.Revit.DB Namespace